SEO優化項目檢查

1.title和H1都是SEO中非常重要的項目，所以在撰寫時要注意以下幾點：

字數：由於在搜尋結果中有顯示字數的上限，所以建議標題字數在50字元(25中文字)以內。
關鍵字：還記得前面提到的核心關鍵字嗎？記得在標題中要包含核心關鍵字。
獨特性：在你的網站中不要有重複標題的網頁。
明確性：標題必須讓讀者一目瞭然你的主題內容，進而思考如何吸引讀者。

2.網頁標題標籤 <title>
3.網頁敘述標籤Meta Description
4.文章主題標籤<H1> ～ <H3>

一個好的文章架構會有一個包含全文的大主題，接著會是次標題、小標題。而在SEO中也有相對應的HTML標籤─H標籤。H1標籤在前面有先介紹過了，總之H1是等同於整篇文章大標題的存在，一個頁面只要設置一個就好。再來還有H2、H3……到H6，數字越大代表重要性越小，H2代表文章段落的次標題；H3代表各個段落內的小標題。

5.圖片敘述標籤alt → 關於圖片設置alt敘述的教學

是否適當地將關鍵字放入上述標籤以及內文中

合理的title、description、keywords：搜索对着三项的权重逐个减小，title值强调重点即可；description把页面内容高度概括，不可过分堆砌关键词；keywords列举出重要关键词。
语义化的HTML代码，符合W3C规范：语义化代码让搜索引擎容易理解网页
重要内容HTML代码放在最前：搜索引擎抓取HTML顺序是从上到下，保证重要内容一定会被抓取
重要内容不要用js输出：爬虫不会执行js获取内容
少用iframe：搜索引擎不会抓取iframe中的内容
非装饰性图片必须加alt
提高网站速度：网站速度是搜索引擎排序的一个重要指标
前后端分离的项目使用服务端同构渲染，既提高了访问速度，同时重要关键内容首次渲染不通过 js 输出
友情链接，好的友情链接可以快速的提高你的网站权重
外链，高质量的外链，会给你的网站提高源源不断的权重提升
向各大搜索引擎登陆入口提交尚未收录站点